# IsGroundPlaneLevelValid Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SunAndShadowSettings..::..IsGroundPlaneLevelValid Method
SunAndShadowSettings Class See Also
---
Checks whether the element represents a valid Ground Plane level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsGroundPlaneLevelValid(
	ElementId levelId
)
```

Visual Basic
---
```text
Public Function IsGroundPlaneLevelValid ( _
	levelId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsGroundPlaneLevelValid(
	ElementId^ levelId
)
```

# ### Parameters
levelId
    Type: Autodesk.Revit.DB..::..ElementId Level element id.
# ### Return Value
True if the element is a valid Ground Plane Level, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace